# Задача 2: Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

a=int(input("Введите 1-ое число: "))

b=int(input("Введите 2-ое число: "))

c=int(input("Введите 3-ое число: "))

print(a, '+', b, '+', c, '=', a+b+c)